<p><b>Вычисление значения функций<b><p>
<?php
$a = rand(-20,20);
$b = rand(-20,20);
$c = rand(-20,20);
$d = rand(-20,20);

 $func1=(42*$c-$d/2+1)/($a*$a-$b-5);
 $func2=((2*$c/$d)+2)/($d-$a*$a-1);

          echo 'Вариант 7'.'<br>';
 echo '42*'.$c.'-'.$d.'/2+1'.'<br>';
 echo '----------------';	
  echo '  =  '.$func1.'<br>'.$a.'^2-'.$b.'-5'.'<br>';
		  echo '<br>';


          echo 'Вариант 10'.'<br>';
 echo '(2*'.$c.')/'.$d.'+2'.'<br>';
 echo '----------------';
 echo '  =  '.$func2.'<br>'.$d.'-'.$a.'^2-1'.'<br>';
          echo '<br>';		  
		  
?>